perf/timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    python_replicated:
      target: 'http://localhost:5555/python_replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-python_replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 120
      arrivalRate: 5

scenarios:
  - name: Timeout (/rimeout)
    flow:
      - get:
          url: '/timeout'